org_str="""
2025
02-08
2025
03-08
2025
¥478.78
本金:0.00
利息:478.78
¥432.44
本金:0.00 利息:432.44
¥478.78
04-08
2025
05-08
2025
06-08
2025
07-08
2025
08-08
2025
¥463.33
本金:0.00 利息:463.33
¥478.78
本金:0.00
利息:478.78
¥463.33
本金:0.00
利息:463.33
¥478.78
本金:0.00
利息:478.78
¥478.78
AO-个
22:
不京
2025
10-08
2025
11-08
2025
12-08
2026
01-08
2026
¥463.33
本金:0.00
利息:463.33
¥478.78
本金:0.00
利息:478.78
¥463.33
本金:0.00 利息:463.33
¥478.78
本金:0.00 利息:478.78
¥8,576.79
本金:8.113.46 利息:463.33
2026
03-08
2026
04-08
2026
05-08
2026
06-08
2026
07-08
2026
08-08
2026
09-08
2026
10-08
2026
11-08
2026
12-08
2027
01-08
2027
02-08
2027
03-08
2027
04-08
2027
05-08
2027
06-08
2027
07-08
2027
08-08
2027
09-08
¥8,576.79
本金:8,132.25
利息:444.54
¥8,576.79
本金:8.151.09
利息:425.70
¥8,576.79
本金:8169.98
利息:406.81
¥8,576.79
本金:8,188.90
利息:387.89
¥8,576.79
本金:8,207.87 利息:368.92
¥8,576.79
本金:8,226.89
利息:349.90
¥8,576.79
本金:8,245.95
利息:330.84
¥8,576.79
本金:8,265.05
利息:311.74
¥8,576.79
本金:8,284.20
利息:292.59
¥8,576.79
本金:8,303.39
利息:273.40
¥8,576.79
本金:8,322.63
利息:254.16
¥8,576.79
本金:8,341.91 利息:234.88
¥8,576.79
本金:8,361.23 利息:215.56
¥8,576.79
本金:8,380.60 利息:196.19
¥8,576.79
本金:8,400.02 利息:176.77
¥8,576.79
本金:8.419.48
利息:157.31
¥8,576.79
本金:8.438.98
利息:137.81
¥8,576.79
本金:8.458.53
利息:118.26
¥8,576.79
本金:8,478.13 利息:98.66
¥8,576.79
10-08
2027
11-08
2027
12-08
2028
01-08
本金:8,497.77 利息:79.02
¥8,576.79
本金:8,517.46 利息:59.33
¥8,576.79
本金:8.537.19
利息:39.60
¥8,577.52
本金:8.557.04
利息:20.48
已经到底了~
已经到底了~"""

import re

money_format=r"(\d{1,3}(?:,\d{3})*(?:\.\d+)?|\d+\.\d+|\d+)"

# 使用正则表达式匹配利息值
interest_values = re.findall(f'利息:{money_format}', org_str)
principal_values = re.findall(f'本金:{money_format}', org_str)
date_values=re.findall(r'\d{2}-\d{2}', org_str)

print(len(date_values),len(principal_values),len(interest_values))

vals=zip(date_values,principal_values,interest_values)

for date,principal,interest in vals:
    print(f'{date}日,本金:{principal},利息:{interest}')


print(principal_values)

# 将匹配到的利息值转换为浮点数
interest_values = [float(value) for value in interest_values]

print(interest_values)